<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// [ 应用入口文件 ] 用户发起的请求都会经过应用的入口文件，当然，也可以更改或者增加新的入口文件

// 定义应用目录
define('APP_PATH', __DIR__ . '/../application/');
define('CONF_PATH',__DIR__ . '/../conf/');
define('EXTEND_PATH',__DIR__ . '/../extend/');
// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php';

